//====================================================================================================================
//====================================================================================================================
// utils/testLogger.js
// 테스트환경에서만 사용할 테스트 로거
//====================================================================================================================
//====================================================================================================================

// 테스트 로그 보일지 말지 결정할 플래그 부울
const flag = true;

export const testLog = (index = 0, msg) => {
    if (!flag) return;
    const logMsg = "[TestLogger]: " + msg;
    switch (index) {
        case 0:
            console.log(logMsg);
            break;
        case 1:
            console.error(logMsg);
            break;
        case 2:
            console.warn(logMsg);
            break;
        case 3:
            console.info(logMsg);
            break;
    }
}